Информационная_база/src/InformationRegisters/КодыТоваровPLUНаОборудовании/КодыТоваровPLUНаОборудовании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КодыТоваровPLUНаОборудовании</name>
  <resources>
    <name>КодТовараSKU</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПравилоОбмена</name>
    <type>
      <types>CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодТовараPLU</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/InformationRegisters/КодыТоваровPLUНаОборудовании/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура УдалитьPLU(ПравилоОбмена, PLU) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.КодыТоваровPLUНаОборудовании.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПравилоОбмена  = ПравилоОбмена;
	МенеджерЗаписи.КодТовараPLU   = PLU;
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
